Repository: ruafelianna/Andromeda.Tools
Catalog: Andromeda.Tools.PublishPackages/Assets/Strings.*.resx
Languages: ru_ru

# Dialog_SelectPackageFolder
source: Select containing NuGet package folder
ru_ru: Выберите содержащую NuGet-пакет директорию

# Error_CannotCreateNuGetClient
source: Cannot create NuGet client: {0}
ru_ru: Не удалось создать клиент NuGet: {0}

# Error_CannotCreateProcess
source: Cannot create a new process
ru_ru: Не удалось создать новый процесс

# Error_CannotPushPackages
source: Cannot push packages
ru_ru: Не удалось отправить пакеты

# Error_ChooseFolder
source: Error while choosing folder
ru_ru: Ошибка при выборе директории

# Error_NoNuGetAPIKey
source: No NuGet API key provided
ru_ru: Невозможно получить API-токен NuGet

# Error_ProcessReturnedCode
source: Process returned exit code = {0}
ru_ru: Процесс завершился с кодом выхода = {0}

# Error_RemovePackage
source: Cannot remove package: {0}
ru_ru: Не удалось удалить пакет: {0}

# Error_ServerNameIsNull
source: Server name is null
ru_ru: Имя сервера не заполнено

# Error_TimeoutException
source: No answer
ru_ru: Нет ответа

# Error_UpdatePackagesList
source: Cannot update packages list
ru_ru: Не удалось обновить список пакетов

# Info_DirectoryChosen
source: Directory is chosen: {0}
ru_ru: Выбрана директория: {0}

# Info_FolderAdded
source: Folder is added: {0}
ru_ru: Директория добавлена: {0}

# Info_FolderExists
source: Directory already exists: {0}
ru_ru: Директория уже добавлена: {0}

# Info_FoldersRemoved
source: Folders are removed: {0}
ru_ru: Директории удалены: {0}

# Info_PackageFilesListed
source: NuGet package files were listed for {0} folders
ru_ru: Файлы с NuGet-пакетами были перечислены для {0} директории(-ий)

# Info_PackageRemoved
source: Package is removed: {0}
ru_ru: Пакет удалён: {0}

# Info_PackagesListUpdated
source: Packages list is updated, count = {0}
ru_ru: Список пакетов обновлён, количество = {0}

# Info_PackagesPushed
source: Packages pushed: {0}
ru_ru: Пакетов отправлено: {0}

# Info_ServerAdded
source: Server is added: {0}
ru_ru: Сервер добавлен: {0}

# Info_ServerRemoved
source: Server is removed: {0}
ru_ru: Сервер удалён: {0}

# View_Btn_Add
source: Add
ru_ru: Добавить

# View_Btn_PushSelectedPackages
source: Push selected packages
ru_ru: Отправить выбранные пакеты

# View_Btn_Refresh
source: Refresh
ru_ru: Обновить

# View_Btn_Remove
source: Remove
ru_ru: Удалить

# View_Btn_RemoveSelectedFolders
source: Remove selected folders
ru_ru: Удалить выбранные директории

# View_Btn_Update
source: Update
ru_ru: Обновить

# View_ChooseOrEnterFolder
source: Choose or enter a folder
ru_ru: Выберите или введите директорию

# View_ChooseServer
source: Choose server
ru_ru: Выберите сервер

# View_EnterNewServer
source: Enter new server
ru_ru: Введите новый сервер

# View_Tab_Push
source: Push
ru_ru: Отправка

# View_Tab_Search
source: Search
ru_ru: Поиск

# View_Title
source: Packages Helper
ru_ru: Помощник пакетов
